package info;

public  class StemmingMatrix {

    final private static String [][]regulationCase={
            {"бен","","жз","КС"},
            {"пен","","пкқтсфхцчшбвгд","КС"},
            {"дан","ден","лруйжзаоұыяəөүіе","ШС"},
            {"тан","тен","бвгдпкқтсфхцчш","ШС"},
            {"тың","тің","бвгдпкқтсфхцчш","ІС"},
            {"ның","нің","мнңаоұыяəөүіе","ІС"},
            {"дың","дің","июлруйжз","ІС"},
            {"нан","нен","імнң","ШС"},
            {"мен","","аоұыяəөүіерлмнңйу","КС"},
            {"да","де","жзаоұыяəөүіерлмнңйу","ЖС"},
            {"та","те","пкқтсфхцчшбвгд","ЖС"},
            {"ды","ді","июжзрлмнңйу","ТС"},
            {"ты","ті","пкқтсфхцчшбвгд","ТС"},
            {"ны","ні","аоұыяəөүіе","ТС"},
            {"ын","ін","жзаоұыяəөүіерлмнңйу","ТС"},
            {"ға","ге","жзаоұыяəөүіерлмнңйу","БС"},
            {"на","не","ыі","БС"},
            {"қа","ке","бвгдпкқтсфхцчш","БС"},
            {"а","е","ң","БС"},

    };




    final static  String[][] regularPlural={
            {"дар","дер","лмнңжз"},
            {"тар","тер","пкқтсфхцчшбвгд"},
            {"лар","лер","аоұыяаəөүіерйу"},
    };
    final static  String[][] regKosem={
            {"қалы","келі","пкқтсш"},
            {"ғалы","гелі","жзаоұыяəөүіерлмнңйу"},
    };
    final static  String[][] regEsimshe={
            {"ған","ген","жзаоұыяəөүіерлмнңйу"},
            {"қан","кен","пкқтсш"},
            {"мақ","мек","аоұыяəөүіелруй"},
            {"бақ","бек","мнңбгғжзд"},
            {"пақ","пек","пкқтсш"},
            {"атын","етін","жзрлмнңйу"},
            {"йтын","йтін","аоұыяəөүіе"},
            {"ушы","уші","жзаоұыяəөүіерлмнңйу"},
    };


    final static  String[][] regularPers={
            {"мын", "мін", "аоұыяəөүіерлмнңйу","Ж-1Ж"},
            {"бын", "бін", "жз","Ж-1Ж"},
            {"пын", "пін", "пкқтсфхцчшбвгд","Ж-1Ж"},
            {"мыз", "міз", "аоұыяəөүіерлйу","Ж-1К"},
            {"быз", "біз", "жзмнң","Ж-1К"},
            {"пыз", "піз", "пкқтсфхцчшбвгд","Ж-1К"},
            {"сың", "сің", "аоұыяəөүіерлжзмнңйупкқтсфхцчшбвгд","Ж-2Ж"},
            {"сыз", "сіз", "аоұыяəөүіерлжзмнңйупкқтсфхцчшбвгд","Ж-2К"},

    };
    public static String []getCase(int row) {
        return regulationCase[row];
    }
    public static String  []getPlural(int row){
        return  regularPlural[row];
    }
    public static String[]getPers(int row){
        return regularPers[row];
    }

    public static boolean checkLetter(String word,String aff){
        boolean b=true;
        int lenWord=word.length();
        int lenAff=aff.length();
        if (lenWord<=lenAff)return false;
        char endWord=word.charAt(lenWord-1);
        char beginAff=aff.charAt(0);
        return b;
    }

}
